Repository: MustafaEH/kidney_disease_classification
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Kidney Scan
ar: فحص الكلى

source: Kidney Scan
ar: فحص الكلى

source: Take Kidney Image
ar: التقاط صورة الكلى

source: Analyze Kidney
ar: تحليل الكلى

source: No Image Selected
ar: لم يتم اختيار صورة

# takePhotoOrSelect
source: Take a photo or select from gallery
ar: التقاط صورة أو اختيار من المعرض

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# instructions
source: Capture a clear image of the kidney for analysis. Ensure proper lighting and focus for accurate results.
ar: التقط صورة واضحة للكلى للتحليل. تأكد من الإضاءة المناسبة والتركيز للحصول على نتائج دقيقة.

# apiWarning
source: API server is not available. Please ensure the server is running.
ar: خادم API غير متاح. يرجى التأكد من تشغيل الخادم.

source: Checking API connection...
ar: التحقق من اتصال API...

# apiAvailable
source: API is available! ✅
ar: API متاح! ✅

# apiNotAvailable
source: API not available. Check console for details. ❌
ar: API غير متاح. تحقق من وحدة التحكم للتفاصيل. ❌

# debugError
source: Debug error: {error}
ar: خطأ في التصحيح: {error}

# error
source: Error: {error}
ar: خطأ: {error}

source: Language
ar: اللغة

source: Settings
ar: الإعدادات

source: About
ar: حول

source: Version
ar: الإصدار

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Select Language
ar: اختر اللغة

source: Scan Result
ar: نتيجة الفحص

source: No Results Available
ar: لا توجد نتائج متاحة

# unableToProcess
source: Unable to process the image. Please try again.
ar: تعذر معالجة الصورة. يرجى المحاولة مرة أخرى.

source: Retake Scan
ar: إعادة الفحص

source: Confidence Level
ar: مستوى الثقة

source: Recommendations
ar: التوصيات

# diseaseCyst
source: Cyst
ar: تكيس

# diseaseTumor
source: Tumor
ar: ورم

# diseaseNormal
source: Normal
ar: سليم

# diseaseInvalidImage
source: Invalid Image
ar: صورة غير صالحة

# diseaseUnknown
source: Unknown
ar: غير معروف

# recConsultNephrologist
source: Consult a nephrologist immediately
ar: استشر طبيب الكلى فوراً

# recFollowUpTests
source: Follow up with additional tests
ar: قم بإجراء اختبارات إضافية

# recMonitorSymptoms
source: Monitor symptoms closely
ar: راقب الأعراض عن كثب

# recMaintainMeds
source: Maintain prescribed medications if any
ar: استمر في تناول الأدوية الموصوفة إذا وجدت

# recMonitorCystSize
source: Monitor cyst size regularly
ar: راقب حجم التكيس بانتظام

# recAvoidTrauma
source: Avoid activities that may cause trauma to the kidney area
ar: تجنب الأنشطة التي قد تسبب إصابة لمنطقة الكلى

# msgCystDetected
source: Possible indication of cyst detected. Consider consulting a healthcare professional for further evaluation.
ar: هناك احتمال لوجود تكيس. يرجى استشارة مقدم الرعاية الصحية لمزيد من التقييم.
